app/controllers/comments_controller.rb

  def new
    @repbody = Repbody.find(params[:repbody_id])
    @comment = Comment.new
    @comment.repbody_id = @repbody.id
    @user = User.find(@repbody.user_id)
---
SELECT  "repbodies".* FROM "repbodies" WHERE "repbodies"."id" = ? LIMIT 1  [["id", 430]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 17]]

  def create
    @comment = Comment.new(comment_params)
    @repbody = Repbody.find(params[:repbody_id])
    @repbody.commentexis = "ok"
    @repbody.save
    @users = User.all
    @update = Update.new
    @current = Time.now
    @comment.date = @current.strftime('%Y-%m-%d %H:%M:%S')
    respond_to do |format|
      if @comment.save
        @update.date = @current.strftime('%Y-%m-%d %H:%M:%S')
        @update.comment = "コメント追加 [#{@current_user.username}] "
        @update.repbody_id = @repbody.id
        @update.save
        if params[:revised] == '1'
          Repbody.where(:id => @update.repbody_id).update_all(:fix => 'f')
---
SELECT  "repbodies".* FROM "repbodies" WHERE "repbodies"."id" = ? LIMIT 1  [["id", 430]]
UPDATE "repbodies" SET "commentexis" = 'ok', "updated_at" = '2015-08-10 06:34:13.017057', "lock_version" = 1 WHERE "repbodies"."id" = ? AND "repbodies"."lock_version" = ?  [["id", 430], ["lock_version", 0]]
INSERT INTO "comments" ("user_id", "repbody_id", "body", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 17], ["repbody_id", 430], ["body", "test"], ["date", "2015-08-10"], ["created_at", "2015-08-10 06:34:13.121388"], ["updated_at", "2015-08-10 06:34:13.121388"]]
INSERT INTO "updates" ("date", "comment", "repbody_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date", "2015-08-10 15:34:13"], ["comment", "コメント追加 [渡辺 健介] "], ["repbody_id", 430], ["created_at", "2015-08-10 06:34:13.221506"], ["updated_at", "2015-08-10 06:34:13.221506"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 17]]