app/controllers/repbodies_controller.rb

SELECT  "years".* FROM "years" WHERE "years"."default" = ? LIMIT 1  [["default", "t"]]
SELECT "years".* FROM "years"  ORDER BY updated_at DESC
SELECT "tags".* FROM "tags"  ORDER BY updated_at DESC
SELECT "users"."id" FROM "users" WHERE ("users"."machine" LIKE '%joho04%' OR "users"."machine" LIKE '%joho05%')
SELECT "users".* FROM "users"
---
  def index
    @thisyear = Year.find_by(default: 't')
    @yearserch = params[:yearserch].to_i
    @years = Year.all
#    @years = Year.order("year DESC")
    @years = Year.order("updated_at DESC")
    @year_name = Array.new
    @years.each do |year|
      @year_name[year.id.to_i] = year.year.to_s
    end

    @tagserch = 0
    @tagserch = params[:tagserch].to_i
#    @tags = Tag.all
#    @tags = Tag.order("tag DESC")
    @tags = Tag.order("updated_at DESC")
    @tag_name = Array.new
    @tags.each do |tag|
      @tag_name[tag.id.to_i] = tag.tag.to_s
    end
    @tag_name.delete_at(0)

    params[:keywords] ||= ""
#    keyword_arrays = params[:keywords].gsub(/　/," ").split()
    keyword_arrays = params[:keywords].split()
    usermachines = User.arel_table[:machine]
    usermachines_sel = usermachines.matches("\%#{keyword_arrays[0]}\%")
    for i in 1...keyword_arrays.length
      usermachines_sel = usermachines_sel.or(usermachines.matches("\%#{keyword_arrays[i]}\%"))
    end
    logger.debug("SQL: #{User.where(usermachines_sel).to_sql}")
    @usermachinex = User.where(usermachines_sel).pluck(:id)
    @usernamex    = User.where(usermachines_sel).pluck(:id)

    @users = User.all

SELECT "repbodies".* FROM "repbodies" WHERE "repbodies"."year" = ? AND "repbodies"."tag_id" = ? AND "repbodies"."user_id" IN (31, 33, 34, 49, 51, 67, 71, 80, 84, 88, 99, 103, 136, 137, 139, 146, 31, 33, 34, 49, 51, 67, 71, 80, 84, 88, 99, 103, 136, 137, 139, 146)  ORDER BY "repbodies"."updated_at" DESC  [["year", 2015], ["tag_id", 31]]
---
      @h1 = "#{@year_name[@yearserch]} 年度のタグ「#{@tag_name[@tagserch -1]}」のレポート一覧"
      else
#      @repbodies = Repbody.where(year: @year_name[@yearserch], tag_id: @tagserch, user_id: @userserch)
      @repbodies = Repbody.where(year: @year_name[@yearserch], tag_id: @tagserch, user_id: [@usernamex, @usermachinex]).order(:updated_at).reverse_order

SELECT "repbodies".* FROM "repbodies" WHERE "repbodies"."user_id" IN (1, 2, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 154, 155, 156, 157, 158, 159, 160, 161, 162, 164, 165, 1, 2, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 154, 155, 156, 157, 158, 159, 160, 161, 162, 164, 165)  ORDER BY "repbodies"."updated_at" DESC
---
      end
    else
      if @keyword != ""
      @repbodies = Repbody.where(user_id: [@usernamex, @usermachinex]).order(:updated_at).reverse_order

SELECT "roles".* FROM "roles"
---
    @comment = Comment.all
#    @role = Role.find(:first, :conditions => ["position = ?", '受講生'])
    @roleh =Hash::new
    @roles = Role.all

SELECT  "repbodies".* FROM "repbodies" WHERE "repbodies"."id" = ? LIMIT 1  [["id", 430]]
SELECT  "comments".* FROM "comments" WHERE "comments"."repbody_id" = ? LIMIT 1  [["repbody_id", 430]]
SELECT "users".* FROM "users"
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 12]]
SELECT "usercomments".* FROM "usercomments" WHERE "usercomments"."repbody_id" = ?  [["repbody_id", 430]]
SELECT "updates".* FROM "updates" WHERE "updates"."repbody_id" = ?  [["repbody_id", 430]]
SELECT "hyperlinks".* FROM "hyperlinks" WHERE "hyperlinks"."repbody_id" = ?  [["repbody_id", 430]]
SELECT "roles".* FROM "roles"
---
  def show
    @repbodyidshow = Repbody.find(params[:id])
#    @commentidshow = Comment.find(params[:id])
    @commentidshow = Comment.find_by(repbody_id: @repbodyidshow.id)
    @users = User.all
    @usernameh = Hash::new
    @users.each do |user|
      @usernameh["#{user.id}"] = user.username
    end
    @tag = Tag.find(@repbodyidshow.tag_id)
    @comments = Comment.where(repbody_id: @repbodyidshow.id)
#    @usercomments = Usercomment.find_by(repbody_id: @repbodyidshow.id, comment_id: @commentidshow.id)
    @usercomments = Usercomment.where(repbody_id: @repbodyidshow.id)
    @updates = Update.where(repbody_id: @repbodyidshow.id)
    @hyperlinks = Hyperlink.where(repbody_id: @repbodyidshow.id)
    @urlhere = request.url
    @roleh =Hash::new
    @roles = Role.all

SELECT  "years".* FROM "years" WHERE "years"."default" = ? LIMIT 1  [["default", "t"]]
SELECT "tags".* FROM "tags" WHERE (tag like '%[2016]%' )
---
  def new
    @repbody = Repbody.new
      @slink = Array.new
    for i in 1..5 do
      @hyperlink_#{i} = Hyperlink.new
      @slink << @hyperlink_#{i}
    end

#    @tag = Tag.all
    @thisyear = Year.find_by(default: 't')
    @yearname = @thisyear.year.to_s
#    @tag = Tag.find(:all, :conditions => [ "tag like ? ", '%2014%' ] )
    @tag = Tag.where("tag like ? ", "%[#{@yearname}]%" )

SELECT  "years".* FROM "years" WHERE "years"."default" = ? LIMIT 1  [["default", "t"]]
INSERT INTO "repbodies" ("user_id", "tag_id", "title", "body", "date", "year", "fix", "created_at", "updated_at", "lock_version") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @repbody = Repbody.new(repbody_params)
#    @hyperlink = Hyperlink.new(params[:hyperlinks])
    @slink = params[:slink].to_a

#    @hyperlink1 = Hyperlink.new
#    @hyperlink2 = Hyperlink.new
#    @hyperlink3 = Hyperlink.new
#    @hyperlink1.attributes = {:link => "params[:hyperlinks[link[0]]]", :repbody_id => @repbody.id }
#    @hyperlink2.attributes = {:link => "params[:hyperlinks{link[1]]]", :repbody_id => @repbody.id }
#    @hyperlink3.attributes = {:link => "params[:hyperlinks[link[2]]]", :repbody_id => @repbody.id }
#    @hyperlinka = [@hyperlink1,@hyperlink2,@hyperlink3]

    @update = Update.new
    @current = Time.now
    @update.date = @current.strftime('%Y-%m-%d %H:%M:%S')
    @update.comment = "レポート新規作成"
    @repbody.date = @current.strftime('%Y-%m-%d %H:%M:%S')
    @thisyear = Year.find_by(default: 't')
    @repbody.year = @thisyear.year.to_i
    @repbody.fix = "t"
    respond_to do |format|
      if @repbody.save

INSERT INTO "updates" ("date", "comment", "repbody_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date", "2015-08-10 15:24:21"], ["comment", "レポート新規作成"], ["repbody_id", 20], ["created_at", "2015-08-10 06:24:21.634714"], ["updated_at", "2015-08-10 06:24:21.634714"]]
---
#            m.save
#          end
        @update.repbody_id = @repbody.id
        @update.save