app/controllers/sessions_controller.rb

  def create
    user = User.find_by_account(params[:account]) rescue nil
    if user.nil?
      redirect_to login_path, :notice => "【メッセージ】アカウント名とパスワードを確認してもう一度やり直してください"
    else
      if user.acception
#       @thisyear = Year.where(default: 't')
#       @role = Role.where("position = ?", '受講生')
#       if @thisyear.year != user.year && user.role_id.to_i == @role.id.to_i
#           redirect_to login_path, :notice => "【メッセージ】過去年度の受講生はログイン出来ません"
       if user && user.authenticate(params[:password])
#        if user && user.authenticate(params[:password])
          session[:user_id] = user.id
          repbody = Repbody.find_by_user_id(user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."account" = ? LIMIT 1  [["account", "wataken"]]
SELECT  "repbodies".* FROM "repbodies" WHERE "repbodies"."user_id" = ? LIMIT 1  [["user_id", 17]]