app/controllers/users_controller.rb

  def index
    @thisyear = Year.find_by(default: 't')
    @yearserch = params[:yearserch].to_i
#    @years = Year.all
    @years = Year.order("year DESC")
    @year_name = Array.new
    @years.each do |year|
      @year_name[year.id.to_i] = year.year.to_s
    end
#    @year_name.delete_at(0)
    @users = User.all
    @roles = Role.all
    @role = Hash::new
    @roles.each do |role|
      @role["#{role.id}"] = role.position
    end

    params[:keywords] ||= ""
#    keyword_arrays = params[:keywords].gsub(/　/," ").split()
    keyword_arrays = params[:keywords].split()
#    usermachines = User.arel_table[:machine].pluck(:id)
    usermachines = User.arel_table[:machine]
    usermachines_sel = usermachines.matches("\%#{keyword_arrays[0]}\%")
    for i in 1...keyword_arrays.length
      usermachines_sel = usermachines_sel.or(usermachines.matches("\%#{keyword_arrays[i]}\%"))
    end
    logger.debug("SQL: #{User.where(usermachines_sel).to_sql}")
    @usermachinex = User.where(usermachines_sel).pluck(:id)

    @keyword = params[:keyword]
    @usernamex    = User.where(account: @keyword).pluck(:id)
#    @usermachinex = User.where(machine: @keyword).pluck(:id)
    if @yearserch != 0
       if @keyword == ""
          @users = User.where(year: @year_name[@yearserch]).order(:machine)
---
SELECT  "years".* FROM "years" WHERE "years"."default" = ? LIMIT 1  [["default", "t"]]
SELECT "years".* FROM "years"  ORDER BY year DESC
SELECT "roles".* FROM "roles"
SELECT "users"."id" FROM "users" WHERE ("users"."machine" LIKE '%%')
SELECT "users"."id" FROM "users" WHERE "users"."account" IS NULL
SELECT "users".* FROM "users" WHERE "users"."year" = ?  ORDER BY "users"."machine" ASC  [["year", 2015]]

#          @h1 = "#{@thisyear.year.to_i} 年度ユーザ検索"
#       end
    end
    @user_waiting = User.where(acception: 'f', owner: current_user.account.to_s )
---
SELECT "users".* FROM "users" WHERE "users"."acception" = ? AND "users"."owner" = ?  [["acception", "f"], ["owner", "wataken"]]

  def indexyear
    params[:keywords] ||= ""
#    keyword_arrays = params[:keywords].gsub(/　/," ").split()
    keyword_arrays = params[:keywords].split()
#    usermachines = User.arel_table[:machine].pluck(:id)
    usermachines = User.arel_table[:machine]
    usermachines_sel = usermachines.matches("\%#{keyword_arrays[0]}\%")
    for i in 1...keyword_arrays.length
      usermachines_sel = usermachines_sel.or(usermachines.matches("\%#{keyword_arrays[i]}\%"))
    end
    logger.debug("SQL: #{User.where(usermachines_sel).to_sql}")
    @usermachinex = User.where(usermachines_sel).pluck(:id)

    @keyword = params[:keyword]
    @usernamex    = User.where(account: @keyword).pluck(:id)
#    @usermachinex = User.where(machine: @keyword).pluck(:id)
    @yearserch = params[:yearserch].to_i
#    @years = Year.all
    @years = Year.order("year DESC")
    @year_name = Array.new
    @years.each do |year|
      @year_name[year.id.to_i] = year.year.to_s
    end
#    @year_name.delete_at(0)
    @users = User.all
    @roles = Role.all
---
SELECT "users"."id" FROM "users" WHERE ("users"."machine" LIKE '%%')
SELECT "users"."id" FROM "users" WHERE "users"."account" IS NULL
SELECT "years".* FROM "years"  ORDER BY year DESC
SELECT "roles".* FROM "roles"

    end
    if @yearserch != 0
       if @keyword == ""
          @users = User.where(year: @year_name[@yearserch]).order(:machine)
---
SELECT "users".* FROM "users" WHERE "users"."year" = ? AND "users"."id" IN (1, 2, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 154, 155, 156, 157, 158, 159, 160, 161, 162, 164, 165)  ORDER BY "users"."machine" ASC  [["year", 2015]]

          @users = User.all.order(:machine)
          @h1 = "全年度ユーザ一覧"
       else
          @users = User.where(id: @usernamex, id: @usermachinex).order(:machine)
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 154, 155, 156, 157, 158, 159, 160, 161, 162, 164, 165)  ORDER BY "users"."machine" ASC

       end
    end

    @user_waiting = User.where(acception: 'f', owner: current_user.account.to_s)
---
SELECT "users".* FROM "users" WHERE "users"."acception" = ? AND "users"."owner" = ?  [["acception", "f"], ["owner", "wataken"]]

  def show
    @user = User.find(params[:id])
    @role = Role.find(@user.role_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 17]]
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", 3]]

  def mypage
    @user = User.find(params[:id])
    @roles = Role.all
    @tag = Tag.all
    @repbody = Repbody.where(user_id: params[:id])
    @tag_name = Array.new
    @tag.each do |tag|
      @tag_name[tag.id.to_i] = tag.tag.to_s
    end
    @tag_name.delete_at(0)
    @role = Hash::new
    @roles.each do |role|
      @role["#{role.id}"] = role.position
    end

    @thisyear = Year.find_by(default: 't')
    @year_name = Array.new
    @year_name = @thisyear.year.to_i
    @user1 = User.all
    @user2 = User.all
    if @user.machine == "joho03"
      @machine1 =  "joho01"
      @machine2 =  "joho02"
      @user1 = User.where(year: @year_name, machine: @machine1)#@machine1 @machine2)#.order(machine)
      @user2 = User.where(year: @year_name, machine: @machine2)#@machine1 @machine2)#.order(machine)
    elsif @user.machine == "joho06"
      @machine1 =  "joho04"
      @machine2 =  "joho05"
      @user1 = User.where(year: @year_name, machine: @machine1)#@machine1 @machine2)#.order(machine)
      @user2 = User.where(year: @year_name, machine: @machine2)#@machine1 @machine2)#.order(machine)
    elsif @user.machine == "joho09"
      @machine1 =  "joho07"
      @machine2 =  "joho08"
      @user1 = User.where(year: @year_name, machine: @machine1)#@machine1 @machine2)#.order(machine)
      @user2 = User.where(year: @year_name, machine: @machine2)#@machine1 @machine2)#.order(machine)
    elsif @user.machine == "joho12"
      @machine1 =  "joho10"
      @machine2 =  "joho11"
      @user1 = User.where(year: @year_name, machine: @machine1)#@machine1 @machine2)#.order(machine)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 17]]
SELECT "roles".* FROM "roles"
SELECT "tags".* FROM "tags"
SELECT "repbodies".* FROM "repbodies" WHERE "repbodies"."user_id" = ?  [["user_id", 17]]
SELECT  "years".* FROM "years" WHERE "years"."default" = ? LIMIT 1  [["default", "t"]]
SELECT "users".* FROM "users" WHERE "users"."year" = ? AND "users"."machine" = ?  [["year", 2015], ["machine", "joho04"]]

  def userreportshow
    @user = User.find(params[:id])
    @role = Role.find(@user.role_id)
    @tag = Tag.all
    @repbody = Repbody.where(user: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 17]]
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", 4]]
SELECT "tags".* FROM "tags"
SELECT "repbodies".* FROM "repbodies" WHERE "repbodies"."user_id" = 137

  def chpass
    @user = User.find(params[:id])
#    @role = Role.find(@user.role_id)
    @role = Role.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 17]]
SELECT "roles".* FROM "roles"